In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
calendar = pd.read_csv('calendar.csv')
vecindarios = pd.read_csv('vecindarios.csv')
listings = pd.read_csv('listings.csv')
reviews = pd.read_csv('reviews.csv')
listings1 = pd.read_csv('listings1.csv')
reviews1 = pd.read_csv('reviews1.csv')

In [3]:
calendar.head()
vecindarios.head()
listings.head()
reviews.head()
listings1.head()
reviews1.head()

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,11508,1615861,2012-07-02,877808,Charlie,Amazing place!\r<br/>\r<br/>Location: short wa...
1,11508,3157005,2012-12-26,656077,Shaily,Really enjoyed Candela's recommendations and q...
2,11508,3281011,2013-01-05,2835998,Michiel,Candela and her colleague were very attentive ...
3,11508,6050019,2013-07-28,4600436,Tara,"The apartment was in a beautiful, modern build..."
4,11508,9328455,2013-12-22,3130017,Simon,My stay at Candela's apartment was very enjoya...

In [4]:
calendar.head()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,11508,2023-06-29,f,"$16,608.00","$16,608.00",3.0,1125.0
1,11508,2023-06-30,f,"$19,163.00","$19,163.00",3.0,1125.0
2,11508,2023-07-01,f,"$19,163.00","$19,163.00",3.0,1125.0
3,11508,2023-07-02,f,"$16,608.00","$16,608.00",3.0,1125.0
4,11508,2023-07-03,f,"$16,608.00","$16,608.00",3.0,1125.0

In [5]:
calendar.describe(include=['O'])

              date available      price adjusted_price
count      9564447   9564447    9564447        9564447
unique         366         2       6615           8823
top     2023-06-29         t  $8,917.00      $8,917.00
freq         26204   5609634     285010         273264

In [6]:
calendar.describe()

         listing_id  minimum_nights  maximum_nights
count  9.564447e+06    9.564415e+06    9.564415e+06
mean   4.208753e+17    6.253008e+00    5.743989e+05
std    3.952350e+17    2.251984e+01    3.509441e+07
min    1.150800e+04    1.000000e+00    1.000000e+00
25%    3.307263e+07    2.000000e+00    3.650000e+02
50%    6.043267e+17    3.000000e+00    1.125000e+03
75%    8.078057e+17    4.000000e+00    1.125000e+03
max    9.232677e+17    1.000000e+03    2.147484e+09

In [7]:
calendar.columns

Index(['listing_id', 'date', 'available', 'price', 'adjusted_price',
       'minimum_nights', 'maximum_nights'],
      dtype='object')

In [8]:
calendar.groupby(['price','adjusted_price']).count()['available']

price          adjusted_price
$1,000,000.00  $1,000,000.00      365
$1,000.00      $1,000.00         1097
$1,022,024.00  $1,022,024.00       31
$1,027,700.00  $904,376.00        199
$1,049.00      $1,049.00          365
                                 ...
$99,818.00     $99,818.00         104
$99,866.00     $99,866.00          65
$99,903.00     $99,903.00          19
$99,999.00     $99,999.00         333
$999.00        $999.00            365
Name: available, Length: 10453, dtype: int64

In [ ]:
grouped_adjusted_price = calendar.groupby(['price','adjusted_price']).count()['available']
print(grouped_adjusted_price)
(grouped_adjusted_price.unstack(level=0).plot.bar())
plt.show()

price          adjusted_price
$1,000,000.00  $1,000,000.00      365
$1,000.00      $1,000.00         1097
$1,022,024.00  $1,022,024.00       31
$1,027,700.00  $904,376.00        199
$1,049.00      $1,049.00          365
                                 ...
$99,818.00     $99,818.00         104
$99,866.00     $99,866.00          65
$99,903.00     $99,903.00          19
$99,999.00     $99,999.00         333
$999.00        $999.00            365
Name: available, Length: 10453, dtype: int64

In [ ]:
grouped_price = calendar.groupby(['price','adjusted_price']).count()['available']
print(grouped_price)
(grouped_price.unstack(level=0).plot.bar())
plt.show()